model {
  ssd {
    num_classes: 2
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"
      depth_multiplier: 1.0
      min_depth: 16
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: [1.0, 2.0, 0.5, 3.0, 0.3333]
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.5
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config {
  batch_size: 8
  fine_tune_checkpoint: "/Users/ashish/Repos/pelsis-rodent/models/pretrained_model/checkpoint/ckpt-0"
  fine_tune_checkpoint_type: "detection"
  num_steps: 20000
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.004
          decay_steps: 800720
          decay_factor: 0.95
        }
      }
    }
  }
}

train_input_reader {
  label_map_path: "/Users/ashish/Repos/pelsis-rodent/annotations/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/Users/ashish/Repos/pelsis-rodent/annotations/rodent_dataset.tfrecord"
  }
}

eval_config {
  num_examples: 100
}

eval_input_reader {
  label_map_path: "/Users/ashish/Repos/pelsis-rodent/annotations/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/Users/ashish/Repos/pelsis-rodent/annotations/rodent_dataset.tfrecord"
  }
}
