# Model Configuration
model {
  ssd {
    num_classes: 2  # Updated for two classes: 'no_rodent' and 'rodent'
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        activation: RELU_6
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
          }
        }
        batch_norm {
          decay: 0.9997
          center: true
          scale: true
          epsilon: 0.001
          train: true
        }
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: [1.0, 2.0, 0.5, 3.0, 0.3333]
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

# Training Configuration
train_config {
  batch_size: 8  # Adjust based on your hardware
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.004
          decay_steps: 800720
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "/Users/ashish/Repos/pelsis-rodent/pretrained_model/checkpoint/ckpt-0"
  fine_tune_checkpoint_type: "detection"
  num_steps: 20000  # Number of training steps
  startup_delay_steps: 0.0
  use_bfloat16: false
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
}

# Training Input Reader
train_input_reader {
  label_map_path: "/Users/ashish/Repos/pelsis-rodent/dataset/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/Users/ashish/Repos/pelsis-rodent/dataset/rodent_dataset.tfrecord"
  }
}

# Evaluation Configuration
eval_config {
  num_examples: 100
  max_evals: 10
  use_moving_averages: false
}

# Evaluation Input Reader
eval_input_reader {
  label_map_path: "/Users/ashish/Repos/pelsis-rodent/dataset/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "/Users/ashish/Repos/pelsis-rodent/dataset/rodent_dataset.tfrecord"
  }
}
